
    --指rootName, pfv是[お気に入り], ?有一?是Layer
    local controlType = "お気に入り"
    local fileName = "茜公式服v2"
    local params = {
      controlType = controlType,
      name = fileName
    }
    --按索引存?各params的name
    local paramsDisplay = {}
    --按索引存?各params的options的name
    local optionsDisplay = {}
    
    --*茜公式服v2/漫符: ["无","涙","おこ","ふぅ","♪","はーと２","はーと１","おっ","ｷﾗｷﾗ","汗４","汗３","！？","！","？","Σ"]
    optionsDisplay[1] = {
      "\157\217","\151\220","\130\168\130\177","\130\211\130\163","\129\244","\130\205\129\91\130\198\130\81","\130\205\129\91\130\198\130\80","\130\168\130\193","\183\215\183\215","\138\190\130\83","\138\190\130\82","\129\73\129\72","\129\73","\129\72","\131\176"
    }
    --常用表互相?接
    paramsDisplay[1] = "\150\159\149\132"
    params[1] = {
      name = paramsDisplay[1],
      display = optionsDisplay[1]
    }
    params[paramsDisplay[1]] = params[1]
    --S.お気に入り/*茜公式服v2/漫符~无
    params[1][1] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\157\217"
    --S.お気に入り/*茜公式服v2/漫符~涙
    params[1][2] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\151\220"
    --S.お気に入り/*茜公式服v2/漫符~おこ
    params[1][3] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\130\168\130\177"
    --S.お気に入り/*茜公式服v2/漫符~ふぅ
    params[1][4] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\130\211\130\163"
    --S.お気に入り/*茜公式服v2/漫符~♪
    params[1][5] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\129\244"
    --S.お気に入り/*茜公式服v2/漫符~はーと２
    params[1][6] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\130\205\129\91\130\198\130\81"
    --S.お気に入り/*茜公式服v2/漫符~はーと１
    params[1][7] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\130\205\129\91\130\198\130\80"
    --S.お気に入り/*茜公式服v2/漫符~おっ
    params[1][8] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\130\168\130\193"
    --S.お気に入り/*茜公式服v2/漫符~ｷﾗｷﾗ
    params[1][9] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\183\215\183\215"
    --S.お気に入り/*茜公式服v2/漫符~汗４
    params[1][10] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\138\190\130\83"
    --S.お気に入り/*茜公式服v2/漫符~汗３
    params[1][11] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\138\190\130\82"
    --S.お気に入り/*茜公式服v2/漫符~！？
    params[1][12] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\129\73\129\72"
    --S.お気に入り/*茜公式服v2/漫符~！
    params[1][13] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\129\73"
    --S.お気に入り/*茜公式服v2/漫符~？
    params[1][14] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\129\72"
    --S.お気に入り/*茜公式服v2/漫符~Σ
    params[1][15] = "S."..controlType.."/*"..fileName.."/\150\159\149\132\126\131\176"
  

    --*茜公式服v2/表情: ["は？","ほえー","ﾍｯ","じとー","ｼｭﾝ","ﾌﾟｰ","ｷｰ","ｱｯﾊｧ","ｱﾍｪ","ｷﾞｬｰｽ","ﾊｯﾊｰﾝ","ﾑｽｯ","ﾆｨ","ウインク","ﾄﾞﾔﾔｧ","得意げ","ふむ","はわわ","ひゃん","YAHOO!","ﾄﾞﾔｯ","おこだよ","むむむっ","いくぜっ","笑顔3","笑顔2","笑顔1+","笑顔1","通常3","通常2","通常1"]
    optionsDisplay[2] = {
      "\130\205\129\72","\130\217\130\166\129\91","\205\175","\130\182\130\198\129\91","\188\173\221","\204\223\176","\183\176","\177\175\202\167","\177\205\170","\183\222\172\176\189","\202\175\202\176\221","\209\189\175","\198\168","\131\69\131\67\131\147\131\78","\196\222\212\212\167","\147\190\136\211\130\176","\130\211\130\222","\130\205\130\237\130\237","\130\208\130\225\130\241","\89\65\72\79\79\33","\196\222\212\175","\130\168\130\177\130\190\130\230","\130\222\130\222\130\222\130\193","\130\162\130\173\130\186\130\193","\143\206\138\231\51","\143\206\138\231\50","\143\206\138\231\49\43","\143\206\138\231\49","\146\202\143\237\51","\146\202\143\237\50","\146\202\143\237\49"
    }
    --常用表互相?接
    paramsDisplay[2] = "\149\92\143\238"
    params[2] = {
      name = paramsDisplay[2],
      display = optionsDisplay[2]
    }
    params[paramsDisplay[2]] = params[2]
    --S.お気に入り/*茜公式服v2/表情~は？
    params[2][1] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\205\129\72"
    --S.お気に入り/*茜公式服v2/表情~ほえー
    params[2][2] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\217\130\166\129\91"
    --S.お気に入り/*茜公式服v2/表情~ﾍｯ
    params[2][3] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\205\175"
    --S.お気に入り/*茜公式服v2/表情~じとー
    params[2][4] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\182\130\198\129\91"
    --S.お気に入り/*茜公式服v2/表情~ｼｭﾝ
    params[2][5] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\188\173\221"
    --S.お気に入り/*茜公式服v2/表情~ﾌﾟｰ
    params[2][6] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\204\223\176"
    --S.お気に入り/*茜公式服v2/表情~ｷｰ
    params[2][7] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\183\176"
    --S.お気に入り/*茜公式服v2/表情~ｱｯﾊｧ
    params[2][8] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\177\175\202\167"
    --S.お気に入り/*茜公式服v2/表情~ｱﾍｪ
    params[2][9] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\177\205\170"
    --S.お気に入り/*茜公式服v2/表情~ｷﾞｬｰｽ
    params[2][10] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\183\222\172\176\189"
    --S.お気に入り/*茜公式服v2/表情~ﾊｯﾊｰﾝ
    params[2][11] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\202\175\202\176\221"
    --S.お気に入り/*茜公式服v2/表情~ﾑｽｯ
    params[2][12] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\209\189\175"
    --S.お気に入り/*茜公式服v2/表情~ﾆｨ
    params[2][13] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\198\168"
    --S.お気に入り/*茜公式服v2/表情~ウインク
    params[2][14] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\131\69\131\67\131\147\131\78"
    --S.お気に入り/*茜公式服v2/表情~ﾄﾞﾔﾔｧ
    params[2][15] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\196\222\212\212\167"
    --S.お気に入り/*茜公式服v2/表情~得意げ
    params[2][16] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\147\190\136\211\130\176"
    --S.お気に入り/*茜公式服v2/表情~ふむ
    params[2][17] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\211\130\222"
    --S.お気に入り/*茜公式服v2/表情~はわわ
    params[2][18] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\205\130\237\130\237"
    --S.お気に入り/*茜公式服v2/表情~ひゃん
    params[2][19] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\208\130\225\130\241"
    --S.お気に入り/*茜公式服v2/表情~YAHOO!
    params[2][20] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\89\65\72\79\79\33"
    --S.お気に入り/*茜公式服v2/表情~ﾄﾞﾔｯ
    params[2][21] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\196\222\212\175"
    --S.お気に入り/*茜公式服v2/表情~おこだよ
    params[2][22] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\168\130\177\130\190\130\230"
    --S.お気に入り/*茜公式服v2/表情~むむむっ
    params[2][23] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\222\130\222\130\222\130\193"
    --S.お気に入り/*茜公式服v2/表情~いくぜっ
    params[2][24] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\130\162\130\173\130\186\130\193"
    --S.お気に入り/*茜公式服v2/表情~笑顔3
    params[2][25] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\143\206\138\231\51"
    --S.お気に入り/*茜公式服v2/表情~笑顔2
    params[2][26] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\143\206\138\231\50"
    --S.お気に入り/*茜公式服v2/表情~笑顔1+
    params[2][27] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\143\206\138\231\49\43"
    --S.お気に入り/*茜公式服v2/表情~笑顔1
    params[2][28] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\143\206\138\231\49"
    --S.お気に入り/*茜公式服v2/表情~通常3
    params[2][29] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\146\202\143\237\51"
    --S.お気に入り/*茜公式服v2/表情~通常2
    params[2][30] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\146\202\143\237\50"
    --S.お気に入り/*茜公式服v2/表情~通常1
    params[2][31] = "S."..controlType.."/*"..fileName.."/\149\92\143\238\126\146\202\143\237\49"
  

    --*茜公式服v2/面部特殊: ["无","影","汗2","汗1","ほっぺ2","ほっぺ"]
    optionsDisplay[3] = {
      "\157\217","\137\101","\138\190\50","\138\190\49","\130\217\130\193\130\216\50","\130\217\130\193\130\216"
    }
    --常用表互相?接
    paramsDisplay[3] = "\150\202\149\148\147\193\142\234"
    params[3] = {
      name = paramsDisplay[3],
      display = optionsDisplay[3]
    }
    params[paramsDisplay[3]] = params[3]
    --S.お気に入り/*茜公式服v2/面部特殊~无
    params[3][1] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\157\217"
    --S.お気に入り/*茜公式服v2/面部特殊~影
    params[3][2] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\137\101"
    --S.お気に入り/*茜公式服v2/面部特殊~汗2
    params[3][3] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\138\190\50"
    --S.お気に入り/*茜公式服v2/面部特殊~汗1
    params[3][4] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\138\190\49"
    --S.お気に入り/*茜公式服v2/面部特殊~ほっぺ2
    params[3][5] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\130\217\130\193\130\216\50"
    --S.お気に入り/*茜公式服v2/面部特殊~ほっぺ
    params[3][6] = "S."..controlType.."/*"..fileName.."/\150\202\149\148\147\193\142\234\126\130\217\130\193\130\216"
  

    --*茜公式服v2/手: ["たくしあげ","ぴーすぴーす","合わせ"]
    optionsDisplay[4] = {
      "\130\189\130\173\130\181\130\160\130\176","\130\210\129\91\130\183\130\210\129\91\130\183","\141\135\130\237\130\185"
    }
    --常用表互相?接
    paramsDisplay[4] = "\142\232"
    params[4] = {
      name = paramsDisplay[4],
      display = optionsDisplay[4]
    }
    params[paramsDisplay[4]] = params[4]
    --S.お気に入り/*茜公式服v2/手~たくしあげ
    params[4][1] = "S."..controlType.."/*"..fileName.."/\142\232\126\130\189\130\173\130\181\130\160\130\176"
    --S.お気に入り/*茜公式服v2/手~ぴーすぴーす
    params[4][2] = "S."..controlType.."/*"..fileName.."/\142\232\126\130\210\129\91\130\183\130\210\129\91\130\183"
    --S.お気に入り/*茜公式服v2/手~合わせ
    params[4][3] = "S."..controlType.."/*"..fileName.."/\142\232\126\141\135\130\237\130\185"
  

    --*茜公式服v2/袖子和衣服: ["デフォ服(たくしあげ","そで","デフォ服","裸体"]
    optionsDisplay[5] = {
      "\131\102\131\116\131\72\149\158\40\130\189\130\173\130\181\130\160\130\176","\130\187\130\197","\131\102\131\116\131\72\149\158","\151\135\145\204"
    }
    --常用表互相?接
    paramsDisplay[5] = "\145\179\142\113\152\97\136\223\149\158"
    params[5] = {
      name = paramsDisplay[5],
      display = optionsDisplay[5]
    }
    params[paramsDisplay[5]] = params[5]
    --S.お気に入り/*茜公式服v2/袖子和衣服~デフォ服(たくしあげ
    params[5][1] = "S."..controlType.."/*"..fileName.."/\145\179\142\113\152\97\136\223\149\158\126\131\102\131\116\131\72\149\158\40\130\189\130\173\130\181\130\160\130\176"
    --S.お気に入り/*茜公式服v2/袖子和衣服~そで
    params[5][2] = "S."..controlType.."/*"..fileName.."/\145\179\142\113\152\97\136\223\149\158\126\130\187\130\197"
    --S.お気に入り/*茜公式服v2/袖子和衣服~デフォ服
    params[5][3] = "S."..controlType.."/*"..fileName.."/\145\179\142\113\152\97\136\223\149\158\126\131\102\131\116\131\72\149\158"
    --S.お気に入り/*茜公式服v2/袖子和衣服~裸体
    params[5][4] = "S."..controlType.."/*"..fileName.."/\145\179\142\113\152\97\136\223\149\158\126\151\135\145\204"
  

    --*茜公式服v2/??: ["无","髪飾り（反転","髪飾り"]
    optionsDisplay[6] = {
      "\157\217","\148\175\143\252\130\232\129\105\148\189\147\93","\148\175\143\252\130\232"
    }
    --常用表互相?接
    paramsDisplay[6] = "\63\63"
    params[6] = {
      name = paramsDisplay[6],
      display = optionsDisplay[6]
    }
    params[paramsDisplay[6]] = params[6]
    --S.お気に入り/*茜公式服v2/??~无
    params[6][1] = "S."..controlType.."/*"..fileName.."/\63\63\126\157\217"
    --S.お気に入り/*茜公式服v2/??~髪飾り（反転
    params[6][2] = "S."..controlType.."/*"..fileName.."/\63\63\126\148\175\143\252\130\232\129\105\148\189\147\93"
    --S.お気に入り/*茜公式服v2/??~髪飾り
    params[6][3] = "S."..controlType.."/*"..fileName.."/\63\63\126\148\175\143\252\130\232"
  

    --*茜公式服v2/后?: ["ついん","ぽにー","しょーと","ろんぐ"]
    optionsDisplay[7] = {
      "\130\194\130\162\130\241","\130\219\130\201\129\91","\130\181\130\229\129\91\130\198","\130\235\130\241\130\174"
    }
    --常用表互相?接
    paramsDisplay[7] = "\141\64\63"
    params[7] = {
      name = paramsDisplay[7],
      display = optionsDisplay[7]
    }
    params[paramsDisplay[7]] = params[7]
    --S.お気に入り/*茜公式服v2/后?~ついん
    params[7][1] = "S."..controlType.."/*"..fileName.."/\141\64\63\126\130\194\130\162\130\241"
    --S.お気に入り/*茜公式服v2/后?~ぽにー
    params[7][2] = "S."..controlType.."/*"..fileName.."/\141\64\63\126\130\219\130\201\129\91"
    --S.お気に入り/*茜公式服v2/后?~しょーと
    params[7][3] = "S."..controlType.."/*"..fileName.."/\141\64\63\126\130\181\130\229\129\91\130\198"
    --S.お気に入り/*茜公式服v2/后?~ろんぐ
    params[7][4] = "S."..controlType.."/*"..fileName.."/\141\64\63\126\130\235\130\241\130\174"
  
    params.keys = paramsDisplay
    params.display = optionsDisplay
    function params.get(key, value)
      local param = params[key]
      if value and value ~= nil then
        return param[value], param.display[value]
      end
      return param, param.name
    end
    return params
  